Revit 2026 API

# DecalFailures Properties

---

The BuiltInFailuresDecalFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotPaste | Can't place Decal at new position. |
|  | LongerThanPossible | Decal element is longer than the circumference of the surface. |
|  | OutsideHost | Decal does not lie on host. |

#### Reference

BuiltInFailuresDecalFailures Class

Autodesk.Revit.DB Namespace